Blender 2.8 beta
shift+c # Центрировать курсор
shift+a # создать объект
shift+s # вызвать меню привязки

# перемещение вращение и масштаб объекта g r s + можно нажать x y z чтобы задать к какой оси привязаться
g # переместить объект
r # повернуть объект

# Чтобы удалить линцеку нужжно вынести один из её концов за пределы окна редактирования

f # создать грань из выделленых точек

tab # переключится на обхект или на его точки

h # hide скрыть выделенное
shift+h # hide скрыть все кроме выделенного
alt+h # unhide показать все скротое 
