# проводник, файловый менеджер, explorer как vim ranger-fm
# Лучший файловый менеджер аля vim ranger-fm
sudo pip install ranger-fm

# просмотр изображений в терминале
sudo apt install w3m-img

# https://www.mankier.com/1/ranger#Key_Bindings

zh # показать скрытые
l, E, <enter> # открыть файл
i # просмотреть файл в ranger
r # открыть файл с помощью… (позволяет выбрать программу, с помощью которой будет открыт файл)
z # изменить настройки (часто используемые тумблеры)
zh # просмотреть скрытые файлы
<space> # выбрать текущий файл
t # отметить файл
cw # переименовать текущий файл
/ # поиск файлов
n # перейти к следующему совпадению
N # вернуться к предыдущему совпадению
yy # скопировать файл
dd # отметить файл, чтобы вырезать
pp # вставить файл
<delete> # удалить выбранный файл.

#Вкладки:

<ctrl>-n  # Создать новую вкладку
<ctrl>-w  # Закрыть текущую вкладку
<tab>  # Следующая вкладка
<shift> <tab>  # Предыдущая вкладка
